ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153dxx_ca7.h
/*!< AHB3 */
#define HSEM_BASE             (AHB3_PERIPH_BASE + 0x0000)
#define IPCC_BASE             (AHB3_PERIPH_BASE + 0x1000)
#define HASH2_BASE            (AHB3_PERIPH_BASE + 0x2000)
#define HASH2_DIGEST_BASE     (AHB3_PERIPH_BASE + 0x2310)
#define RNG2_BASE             (AHB3_PERIPH_BASE + 0x3000)
#define CRC2_BASE             (AHB3_PERIPH_BASE + 0x4000)
#define DCMI_BASE             (AHB3_PERIPH_BASE + 0x6000)

/*!< AHB4 */
#define RCC_BASE              (AHB4_PERIPH_BASE + 0x0000)
#define PWR_BASE              (AHB4_PERIPH_BASE + 0x1000)
#define GPIOA_BASE            (AHB4_PERIPH_BASE + 0x2000)
#define GPIOB_BASE            (AHB4_PERIPH_BASE + 0x3000)
#define GPIOC_BASE            (AHB4_PERIPH_BASE + 0x4000)
#define GPIOD_BASE            (AHB4_PERIPH_BASE + 0x5000)
#define GPIOE_BASE            (AHB4_PERIPH_BASE + 0x6000)
#define GPIOF_BASE            (AHB4_PERIPH_BASE + 0x7000)
#define GPIOG_BASE            (AHB4_PERIPH_BASE + 0x8000)
#define GPIOH_BASE            (AHB4_PERIPH_BASE + 0x9000)
#define GPIOI_BASE            (AHB4_PERIPH_BASE + 0xA000)
#define GPIOJ_BASE            (AHB4_PERIPH_BASE + 0xB000)
#define GPIOK_BASE            (AHB4_PERIPH_BASE + 0xC000)
#define AIEC_BASE             (AHB4_PERIPH_BASE + 0xD000)
#define AIEC_C1_BASE          (AIEC_BASE + 0x0080)
#define AIEC_C2_BASE          (AIEC_BASE + 0x00C0)
/* Alias EXTI_BASE defined because HAL code not yet reworked with new name AIEC*/
#define EXTI_BASE             AIEC_BASE
#define EXTI_C1_BASE          AIEC_C1_BASE
#define EXTI_C2_BASE          AIEC_C2_BASE


/*!< APB3 */
#define SYSCFG_BASE           (APB3_PERIPH_BASE + 0x0000)
#define LPTIM2_BASE           (APB3_PERIPH_BASE + 0x1000)
#define LPTIM3_BASE           (APB3_PERIPH_BASE + 0x2000)
#define LPTIM4_BASE           (APB3_PERIPH_BASE + 0x3000)
#define LPTIM5_BASE           (APB3_PERIPH_BASE + 0x4000)
#define VREFBUF_BASE          (APB3_PERIPH_BASE + 0x5000)
#define SAI4_BASE             (APB3_PERIPH_BASE + 0x7000)
#define SAI4_Block_A_BASE     (SAI4_BASE + 0x004)
#define SAI4_Block_B_BASE     (SAI4_BASE + 0x024)
#define DTS_BASE              (APB3_PERIPH_BASE + 0x8000)
#define PMB_BASE              (APB3_PERIPH_BASE + 0x9000)
#define HDP_BASE              (APB3_PERIPH_BASE + 0xA000)

/*!< AHB4 _APB_Debug */
#define DBGMCU_BASE           ((uint32_t )0x50081000)

/*!< AHB5 */
#define BKPSRAM_BASE          (AHB5_PERIPH_BASE + 0x0000)
#define HASH1_BASE            (AHB5_PERIPH_BASE + 0x2000)
#define HASH1_DIGEST_BASE     (AHB5_PERIPH_BASE + 0x2310)
#define RNG1_BASE             (AHB5_PERIPH_BASE + 0x3000)
#define GPIOZ_BASE            (AHB5_PERIPH_BASE + 0x4000)

/*!< GPV */

/*!< MPU_AHB6 */
#define MDMA_BASE               (AHB6_PERIPH_BASE + 0x0000)
#define FMC_R_BASE              (AHB6_PERIPH_BASE + 0x2000)
#define QSPI_R_BASE             (AHB6_PERIPH_BASE + 0x3000)
#define DLYB_QSPI_BASE          (AHB6_PERIPH_BASE + 0x4000)
#define SDMMC1_BASE             (AHB6_PERIPH_BASE + 0x5000)
#define DLYB_SDMMC1_BASE        (AHB6_PERIPH_BASE + 0x6000)
#define SDMMC2_BASE             (AHB6_PERIPH_BASE + 0x7000)
#define DLYB_SDMMC2_BASE        (AHB6_PERIPH_BASE + 0x8000)
#define CRC1_BASE               (AHB6_PERIPH_BASE + 0x9000)
#define ETH_BASE                (AHB6_PERIPH_BASE + 0xA000)
#define ETH_MAC_BASE            (ETH_BASE)
#define USB1HSFSP2_BASE         (AHB6_PERIPH_BASE + 0xC000)
#define USB1HSFSP1_BASE         (AHB6_PERIPH_BASE + 0xD000)

/*!< MPU_APB4 */
#define LTDC_BASE             (APB4_PERIPH_BASE + 0x1000)
#define LTDC_Layer1_BASE      (LTDC_BASE + 0x84)
#define LTDC_Layer2_BASE      (LTDC_BASE + 0x104)
#define IWDG2_BASE            (APB4_PERIPH_BASE + 0x2000)
#define DDRCTRL_BASE          (APB4_PERIPH_BASE + 0x3000)
#define DDRPHYC_BASE          (APB4_PERIPH_BASE + 0x4000)
#define STGENR_BASE           (APB4_PERIPH_BASE + 0x5000)
#define USBPHYC_BASE          (APB4_PERIPH_BASE + 0x6000)
#define DDRPERFM_BASE         (APB4_PERIPH_BASE + 0x7000)
#define USBPHYC_PHY1_BASE     (USBPHYC_BASE + 0x100)
#define USBPHYC_PHY2_BASE     (USBPHYC_BASE + 0x200)

/*!< MPU_APB5 */
#define USART1_BASE           (APB5_PERIPH_BASE + 0x0000)
#define SPI6_BASE             (APB5_PERIPH_BASE + 0x1000)
#define I2C4_BASE             (APB5_PERIPH_BASE + 0x2000)
#define IWDG1_BASE            (APB5_PERIPH_BASE + 0x3000)
#define RTC_BASE              (APB5_PERIPH_BASE + 0x4000)
#define BSEC_BASE             (APB5_PERIPH_BASE + 0x5000)
#define TZC_BASE              (APB5_PERIPH_BASE + 0x6000)
#define TZPC_BASE             (APB5_PERIPH_BASE + 0x7000)
#define STGENC_BASE           (APB5_PERIPH_BASE + 0x8000)
#define I2C6_BASE             (APB5_PERIPH_BASE + 0x9000)
#define TAMP_BASE             (APB5_PERIPH_BASE + 0xA000)



/*!< USB registers base address */
#define USB_OTG_GLOBAL_BASE                  ((uint32_t )0x000)
#define USB_OTG_DEVICE_BASE                  ((uint32_t )0x800)
#define USB_OTG_IN_ENDPOINT_BASE             ((uint32_t )0x900)
#define USB_OTG_OUT_ENDPOINT_BASE            ((uint32_t )0xB00)
#define USB_OTG_EP_REG_SIZE                  ((uint32_t )0x20)
#define USB_OTG_HOST_BASE                    ((uint32_t )0x400)
#define USB_OTG_HOST_PORT_BASE               ((uint32_t )0x440)
#define USB_OTG_HOST_CHANNEL_BASE            ((uint32_t )0x500)
#define USB_OTG_HOST_CHANNEL_SIZE            ((uint32_t )0x20)
#define USB_OTG_PCGCCTL_BASE                 ((uint32_t )0xE00)
#define USB_OTG_FIFO_BASE                    ((uint32_t )0x1000)
#define USB_OTG_FIFO_SIZE                    ((uint32_t )0x1000)



#define DMA1_Stream0_BASE     (DMA1_BASE + 0x010)
#define DMA1_Stream1_BASE     (DMA1_BASE + 0x028)
#define DMA1_Stream2_BASE     (DMA1_BASE + 0x040)
#define DMA1_Stream3_BASE     (DMA1_BASE + 0x058)
#define DMA1_Stream4_BASE     (DMA1_BASE + 0x070)
#define DMA1_Stream5_BASE     (DMA1_BASE + 0x088)
#define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0)
#define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8)

#define DMA2_Stream0_BASE     (DMA2_BASE + 0x010)
#define DMA2_Stream1_BASE     (DMA2_BASE + 0x028)
#define DMA2_Stream2_BASE     (DMA2_BASE + 0x040)
#define DMA2_Stream3_BASE     (DMA2_BASE + 0x058)
#define DMA2_Stream4_BASE     (DMA2_BASE + 0x070)
#define DMA2_Stream5_BASE     (DMA2_BASE + 0x088)
#define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0)
#define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8)


